WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/hcom/hcom_common.h
// This enum defines the current processing activity for a data packet
// download. This could be modified so that each data packet contains
// this information. This would allow more than one operation to be
// processed at a time.
// To do this the protocol would need to be enhanced so that start download
// command carried an additional field to identify the "series" a particular
// data packet belonged to. Each now dowload command would be unuque and the 
// the sequence numbers 1-n would be unique for each series.
enum hcom_current_recv_action
{
  CurrentHcomDataPacketActionNone,
  CurrentHcomDataPacketActionF7FileXfer, // Could be expanded to specify file type (e.g. mscorlib.dll)
  CurrentHcomDataPacketActionEsp32FileXfer,
};

//----------------------------------------------------------------
// Trace level constants
#define HCOM_TRACE_LEVEL_DEFAULT 0
#define HCOM_TRACE_LEVEL_NOTICE 1
#define HCOM_TRACE_LEVEL_NOTICE_INFO 2
#define HCOM_TRACE_LEVEL_NOTICE_INFO_DEBUG 3

//--------------------------------------------------------------------
// Redefine Battery Backed Registers so we know what's what
#define HCOM_BATTERY_BACKED_REG_SYSLOG_MASK   STM32_RTC_BK31R
#define HCOM_BATTERY_BACKED_REG_MONO_ACCESS   STM32_RTC_BK30R
#define HCOM_BATTERY_BACKED_REG_MONO_ACTION   STM32_RTC_BK29R

#define HCOM_BATTERY_BACKED_REG_BIT_FLAGS     STM32_RTC_BK28R
// This bit indicates if the restart was initiated by hcom command
#define HCOM_BBREG_RESTART_CONCLUDED_BIT_FLAG 0x00000001
// This bit indicates if we are to send trace messages to the host PC
#define HCOM_BBREG_TRACE_MSG_TO_HOST_BIT_FLAG 0x00000002

//--------------------------------------------------------------------
// HCOM protocol
// This protocol consists of a header followed by optional data. The header
// is defined by the '#define HCOM_PROTOCOL_REQUEST_HEADER_XXX_XXX' entries
// below.
//
// Header Fields
// The first field is the 'Sequence Number'. This field is used for 2 purposes.
// If it's value is 0, it indicates that the entire message is in a single
// packet, containing header plus optionally, some data. This is called a "simple"
// message type. Most messages fit this category.
// If the sequence number is > 0 it indicates it's a data packet. A data packet
// must have been proceeded by a header whose optional data fields defined
// how the, soon coming, data packets are to be used. A data packet's only 
// requirement is that the sequence number is > 0. The remainder of the packet
// is available for data.
// Following the last data packet a message indicating the end must follow.
// This ending packet will have a sequence number of zero, just as the header
// did. Currently, this features is only used for sending file data.
//
// Non-data Messages
// As explained above the first 2-byte field has a value of zero (0).
//
// The second header field is a 2-byte 'Version' field. This value is updated
// for each change or enhancment to the protocol.
//
// The third header field is a 2-byte 'Request Type' which defines the type of
// message. Each message type has a unique definition.
//
// The fourth header field is a 2-byte that is for protocol use and called 'extraData'.
//
// The fifth and last header field is a 4-byte 'User Data' field which can used
// for any request specific purpose.
//
// There is no length field. Since the header is fixed length any additional data
// length is easily determined.
//
// Currently, the 2-byte version field is considered a single number which is
// incremented for each protocol change.
#define HCOM_PROTOCOL_HCOM_VERSION_NUMBER   ((uint16_t) 0x0005)
#define HCOM_PROTOCOL_VERSION_CRITICAL_MASK  ((uint16_t) 0xff00)
#define HCOM_PROTOCOL_VERSION_FEATURE_MASK  ((uint16_t) 0x00ff)

#define HCOM_PROTOCOL_REQUEST_HEADER_SIMPLE_SEQ_NUMBER 0

// This are the offsets to the header elements
#define HCOM_PROTOCOL_REQUEST_HEADER_SEQ_OFFSET 0
#define HCOM_PROTOCOL_REQUEST_HEADER_VERSION_OFFSET 2
#define HCOM_PROTOCOL_REQUEST_HEADER_CONTROL_OFFSET 4
#define HCOM_PROTOCOL_REQUEST_HEADER_RQST_TYPE_OFFSET 6
#define HCOM_PROTOCOL_REQUEST_HEADER_USER_DATA_OFFSET 8
#define HCOM_PROTOCOL_REQUEST_HEADER_LENGTH 12

#define HCOM_PROTOCOL_PACKET_DELIMITER_VALUE (0x00)

#define HCOM_PROTOCOL_REQUEST_MAX_SIMPLE_DATA_LEN (HCOM_PROTOCOL_PACKET_MAX_SIZE - HCOM_PROTOCOL_REQUEST_HEADER_LENGTH)

// Unique to FILE type data field definitions
#define HCOM_PROTOCOL_REQUEST_MD5_HASH_LENGTH 32
#define HCOM_PROTOCOL_REQUEST_HEADER_FILE_NAME_OFFSET 44

// The following are the hcom protocol message types
// The upper 8-bits are used to determine the header type
#define HCOM_PROTOCOL_HEADER_TYPE_MASK 0xff00

  enum HcomProtocolHeaderTypes
  {
    HCOM_PROTOCOL_HEADER_TYPE_UNDEFINED = 0x0000,

    // Simple request types, include 4-byte user data. The User data field
    // is type dependent
    HCOM_PROTOCOL_HEADER_TYPE_SIMPLE = 0x0100,

    // File related types includes 4-byte user data (used for the destination
    // partition id), 4-byte file size, 4-byte checksum, 4-byte destination address
    // and variable length destination file name. Note: The  4-byte destination address
    // is currently only used for the STM32F7 to ESP32 downloads.
    HCOM_PROTOCOL_HEADER_TYPE_FILE_START = 0x0200,

    // Simple text. The text will fit in the header extension
    HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT = 0x0300,

    // Header followed by binary data. The size of the data can be up to
    // HCOM_PROTOCOL_PACKET_MAX_SIZE minus header size
    HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_BINARY = 0x0400,
  };

  // Messages sent from host to Meadow 
  enum HcomMeadowRequestType
  {
    HCOM_MDOW_REQUEST_UNDEFINED_REQUEST       = 0x00 | HCOM_PROTOCOL_HEADER_TYPE_UNDEFINED,

    HCOM_MDOW_REQUEST_CREATE_ENTIRE_FLASH_FS  = 0x01 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_CHANGE_TRACE_LEVEL      = 0x02 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_FORMAT_FLASH_FILE_SYS   = 0x03 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_END_FILE_TRANSFER       = 0x04 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_RESET_PRIMARY_MCU       = 0x05 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_VERIFY_ERASED_FLASH     = 0x06 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_PARTITION_FLASH_FS      = 0x07 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_MOUNT_FLASH_FS          = 0x08 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_INITIALIZE_FLASH_FS     = 0x09 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_BULK_FLASH_ERASE        = 0x0a | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_ENTER_DFU_MODE          = 0x0b | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_ENABLE_DISABLE_NSH      = 0x0c | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_LIST_PARTITION_FILES    = 0x0d | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_LIST_PART_FILES_AND_CRC = 0x0e | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_MONO_DISABLE            = 0x0f | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_MONO_ENABLE             = 0x10 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_MONO_RUN_STATE          = 0x11 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_GET_DEVICE_INFORMATION  = 0x12 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_PART_RENEW_FILE_SYS     = 0x13 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_NO_TRACE_TO_HOST        = 0x14 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_SEND_TRACE_TO_HOST      = 0x15 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_END_ESP_FILE_TRANSFER   = 0x16 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_READ_ESP_MAC_ADDRESS    = 0x17 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_RESTART_ESP32           = 0x18 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,

