WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/hcom/hcom_common.h
    // Only used for testing
    HCOM_MDOW_REQUEST_DEVELOPER_1             = 0xf0 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_DEVELOPER_2             = 0xf1 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_DEVELOPER_3             = 0xf2 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_DEVELOPER_4             = 0xf3 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    // Testing QSPI flash
    HCOM_MDOW_REQUEST_S25FL_QSPI_INIT         = 0xf4 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_S25FL_QSPI_WRITE        = 0xf5 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,
    HCOM_MDOW_REQUEST_S25FL_QSPI_READ         = 0xf6 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,

    // The file types have the optional data field defined for sending file information
    HCOM_MDOW_REQUEST_START_FILE_TRANSFER     = 0x01 | HCOM_PROTOCOL_HEADER_TYPE_FILE_START,
    HCOM_MDOW_REQUEST_DELETE_FILE_BY_NAME     = 0x02 | HCOM_PROTOCOL_HEADER_TYPE_FILE_START,
    HCOM_MDOW_REQUEST_START_ESP_FILE_TRANSFER = 0x03 | HCOM_PROTOCOL_HEADER_TYPE_FILE_START,
    
    // This is a simple type with binary data
    HCOM_MDOW_REQUEST_DEBUGGER_MSG            = 0x01 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_BINARY,
  };

  // Messages sent from meadow to host
  enum HcomHostRequestType
  {
    HCOM_HOST_REQUEST_UNDEFINED_REQUEST       = 0x00 | HCOM_PROTOCOL_HEADER_TYPE_UNDEFINED,

    // Simple types
    HCOM_HOST_REQUEST_HEADER_MESSAGE          = 0x01 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE,    // Just the header
    // Simple with mono debug data
    HCOM_HOST_REQUEST_DEBUGGER_MSG            = 0x01 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_BINARY,
    // Simple with some text message
    HCOM_HOST_REQUEST_TEXT_REJECTED           = 0x01 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT,
    HCOM_HOST_REQUEST_TEXT_ACCEPTED           = 0x02 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT,
    HCOM_HOST_REQUEST_TEXT_CONCLUDED          = 0x03 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT,
    HCOM_HOST_REQUEST_TEXT_ERROR              = 0x04 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT,
    HCOM_HOST_REQUEST_TEXT_INFORMATION        = 0x05 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT,
    HCOM_HOST_REQUEST_TEXT_LIST_HEADER        = 0x06 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT,
    HCOM_HOST_REQUEST_TEXT_LIST_MEMBER        = 0x07 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT,
    HCOM_HOST_REQUEST_TEXT_CRC_MEMBER         = 0x08 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT,
    HCOM_HOST_REQUEST_TEXT_MONO_MSG           = 0x09 | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT,
    HCOM_HOST_REQUEST_TEXT_DEVICE_INFO        = 0x0A | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT,
    HCOM_HOST_REQUEST_TEXT_MEADOW_DIAG        = 0x0B | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT,
    HCOM_HOST_REQUEST_TEXT_RECONNECT          = 0x0C | HCOM_PROTOCOL_HEADER_TYPE_SIMPLE_TEXT,
  };

  struct HcomProtocolHeader_s
  {
    uint16_t seqNumber;
    uint16_t version;
    uint16_t rqstType;
    uint16_t extraData;
    uint32_t userData;
  } __attribute__((packed));


  struct host_com_cir_buffer_s
  {
    uint8_t *bottom; // bottom of buffer
    uint8_t *top;    // top end of buffer
    uint8_t *head;   // add data here
    uint8_t *tail;   // remove from here
  };

#ifndef __ASSEMBLY__

#ifdef __cplusplus
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

  /****************************************************************************************************
 * Public Functions
 ****************************************************************************************************/

  // Startup Manager
  int hcom_manager_setup(FAR struct mtd_dev_s *mtd);
#if defined(CONFIG_STM32F7_PWR)
  int hcom_manager_syslog_mask_init(void);
#endif

  // USB CDC/ACM host interface
  int hcom_comms_setup(void);
  void hcom_comms_shutdown(void);
  int hcom_comms_open_connection(void);
  int hcom_comms_handle_initial_connection(void);
  int hcom_comms_recv_thread_loop(void);
  int hcom_comms_transmit_to_host(FAR uint8_t xmitBuffer[], size_t xmitLength);
  bool hcom_comms_is_host_xmit_blocked(void);

  // Host message builder
  int hcom_comms_msg_builder_setup(void);
  void hcom_comms_msg_builder_shutdown(void);
  void hcom_comms_send_header_msg(uint16_t requestType, uint32_t userData,
          char *sourceFileName, int sourceLineNumber);
  void hcom_comms_send_simple_string_msg(uint16_t requestType, uint32_t userData, char *shortText,
          char *sourceFileName, int sourceLineNumber);
  int hcom_comms_send_raw_string_msg(uint16_t requestType, uint32_t userData, char *shortText, size_t msgLength);
  int hcom_comms_send_simple_buffer_msg(uint16_t requestType, uint16_t extraData, uint32_t userData, uint8_t *msgBuffer, size_t msgLen);

  // Save and Parse request
  int hcom_save_parse_request_setup(void);
  void hcom_save_parse_request_shutdown(void);
  int hcom_comms_recv_process_raw_data(uint8_t recvBuff[], const ssize_t recvByteCnt);

  // Execute Request for downloaded file
  int hcom_exec_rqst_download_file_rqst_setup(void);
  bool hcom_exec_rqst_download_is_download_active(void);
  void hcom_exec_rqst_download_file_rqst_start(const uint8_t *recvPacketData,
      const size_t recvPacketDataSize,uint32_t partitionId, uint16_t requestType);
  void hcom_exec_rqst_download_file_rqst_end(uint32_t user_data);
  void hcom_exec_rqst_download_data_packet(const uint8_t *packet, const size_t packetSize, uint16_t seqNumb);

  // Execute Flash file system related request
  int hcom_exec_flash_fs_setup(FAR struct mtd_dev_s *mtd);
  void hcom_exec_flash_fs_delete(const uint8_t *recvPacketData, const size_t recvPacketDataSize, uint32_t user_data);
  void hcom_exec_flash_fs_format(uint32_t partitionId);
  void hcom_exec_flash_fs_partition(uint32_t numbOfPartitions);
  void hcom_exec_flash_fs_mount(uint32_t user_data);
  void hcom_exec_flash_fs_initialize(uint32_t partitionId);
  void hcom_exec_flash_fs_create(uint32_t userData);
  void hcom_exec_flash_fs_return_file_list(uint32_t partitionId);
  void hcom_exec_flash_fs_part_renew_file_system(uint32_t partitionId);
  void hcom_exec_flash_fs_return_file_list_with_crc(uint32_t partitionId);

  // Execute Utility Request
  int hcom_exec_rqst_misc_setup(FAR struct mtd_dev_s *mtd);
  void hcom_exec_flash_fs_flash_bulk_erase(uint32_t user_data);
  void hcom_exec_flash_fs_flash_verify_erase(uint32_t user_data);
  void hcom_exec_rqst_misc_mcu_restart(uint32_t user_data);
  void hcom_exec_rqst_misc_enter_dfu_mode(uint32_t user_data);
  void hcom_exec_rqst_misc_change_trace_level(uint32_t userData);
  void hcom_exec_rqst_misc_enable_disable_nsh(uint32_t userData);
  void hcom_exec_rqst_misc_no_trace_msg_to_host(uint32_t userData);
  void hcom_exec_rqst_misc_send_trace_to_host(uint32_t userData);

  void hcom_exec_rqst_misc_mono_disable(uint32_t userData);
  void hcom_exec_rqst_misc_mono_enable(uint32_t userData);
  void hcom_exec_rqst_misc_mono_run_state(uint32_t userData);
  void hcom_exec_rqst_misc_get_device_info(uint32_t userData);

  // File commands
  int hcom_file_commands_setup(void);
  void hcom_file_commands_shutdown(void);
  bool hcom_file_commands_is_active_file(void);
  int hcom_file_commands_open_active_file(const uint32_t partitionId, const char *mountPoint, const char *fileName);
  int hcom_file_commands_write_to_active_file(const uint8_t *fileWriteData, const size_t fileWriteSize);
  int hcom_file_commands_close_active_file(void);
  uint32_t hcom_file_commands_calc_crc_for_file(char *completeFilePath);
  int hcom_file_commands_delete_by_name(const uint32_t partitionId, const char *mountPoint, const char *fileName);

  // File system helper
  int hcom_fs_setup(FAR struct mtd_dev_s *mtd);
  int hcom_fs_init_file_system(void);
  void hcom_fs_shutdown(void);
  int hcom_fs_create_partition_initialize_and_mount_fs(FAR struct mtd_dev_s *master_flash_mtd, uint32_t numbOfPartitions);
  int hcom_fs_init_partitions(FAR struct mtd_dev_s *master_flash_mtd, uint32_t partitionCount);
  int hcom_fs_mount_file_system(const char *sourceDevice, const char *targetDevice,
                                          const char *fileSystemType, uint32_t partitionId, const char *mountCommand);
  bool hcom_fs_is_mounted(uint32_t partitionId);
  int hcom_fs_1st_erase_sector_of_partition(uint32_t partitionId);
  int hcom_fs_get_list_files_in_partition(uint32_t partitionIdn);
  int hcom_fs_get_list_files_in_partition_and_crc(uint32_t partitionId);
  int hcom_fs_initialize_proxy(uint32_t partitionId);
  int hcom_fs_format_proxy(uint32_t partitionId);

  // Support SmartFS
#ifdef CONFIG_FS_SMARTFS
  int hcom_fs_smartfs_setup(void);
  void hcom_fs_smartfs_shutdown(void);
  int hcom_fs_smartfs_init_part_fs(uint32_t partitionId, struct mtd_dev_s *partMtd);
  int hcom_fs_smartfs_mount_format(uint32_t partitionId);
  int hcom_fs_smartfs_format(int partitionId);
#endif

