WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/hcom/hcom_common.h
  // Support LittleFS
#ifdef CONFIG_FS_LITTLEFS
  int hcom_fs_littlefs_setup(void);
  int hcom_little_support_init_master_fs(FAR struct mtd_dev_s *master_flash_mtd);
  void hcom_fs_littlefs_shutdown(void);
  #ifdef CONFIG_MTD_PARTITION
  int hcom_fs_littlefs_init_part_fs(uint32_t partitionId, struct mtd_dev_s *partMtd);
  #endif
  int hcom_fs_littlefs_mount_format(uint32_t partitionId);
#endif

  // Comms support, COBS encode and receive circular buffer
  size_t hcom_comms_cobs_encoder(uint8_t source[], size_t startingOffset, size_t length, uint8_t encoded[]);
  size_t hcom_comms_cobs_decoder(uint8_t encoded[], size_t length, uint8_t decoded[]);
  int hcom_cirbuf_init(struct host_com_cir_buffer_s *hcom_cbuf, size_t totalCapacity);
  size_t hcom_cirbuf_avail_space(struct host_com_cir_buffer_s *hcom_cbuf);
  int hcom_cirbuf_add_bytes(struct host_com_cir_buffer_s *hcom_cbuf, uint8_t *newBytes, uint32_t bytesToAdd);
  int hcom_cirbuf_get_next_packet(struct host_com_cir_buffer_s *hcom_cbuf, uint8_t *packetBuffer,
                                  size_t packetBufferSize, size_t *packetLength);
  int hcom_cirbuf_release_memory(struct host_com_cir_buffer_s *hcom_cbuf);

  // mono pipe user messages
  int hcom_mono_pipe_setup(void);
  void hcom_mono_pipe_shutdown(void);

  // mono Visual Studio interactions
  int hcom_remote_dbg_setup(void);
  void hcom_remote_dbg_shutdown(void);
  void hcom_remote_dbg_recv_host_send_to_mono(const uint8_t *recvPayload, size_t recvPayloadSize, uint32_t userData);

  // Common Utils and persistent (battery backed) storage functions
  int hcom_utils_setup(void);
  void hcom_utils_shutdown(void);
  void hcom_utils_bbreg_write(uint32_t regNumber, uint32_t value);
  uint32_t hcom_utils_bbreg_read(uint32_t regNumber);
  bool hcom_utils_bbreg_bit_test_and_clear(uint32_t regNumber, uint32_t value);
  void hcom_utils_bbreg_bit_set(uint32_t regNumber, uint32_t value);
  bool hcom_utils_bbreg_bit_test(uint32_t regNumber, uint32_t value);
  void hcom_utils_bbreg_bit_clear(uint32_t regNumber, uint32_t value);
  void hcom_utils_print_header(const uint8_t buffer[], const int bufLen, uint8_t logPriority);
  void hcom_utils_diag_print_buffer(const uint8_t packetBuffer[], const int bufLen, uint8_t logPriority);
  bool hcom_utils_boot_time_qemu_check(void);
  void hcom_utils_boot_time_mono_check(void);
  bool hcom_utils_is_mono_disabled(void);
  void f7syslog(int priority, FAR const IPTR char *fmt, ...);
  void f7syslog_x(int priority, FAR const IPTR char *fmt, ...);
  void f7syslog_host(int priority, FAR const IPTR char *fmt, ...);
  
  // Testing utilities
  int hcom_exec_rqst_testing_setup(FAR struct mtd_dev_s *mtd);
  void hcom_exec_rqst_testing_flash_qspi_init(uint32_t userData);
  void hcom_exec_rqst_testing_flash_qspi_write(uint32_t userData);
  void hcom_exec_rqst_testing_flash_qspi_read(uint32_t userData);
  void hcom_exec_rqst_testing_developer_1(uint32_t userData);
  void hcom_exec_rqst_testing_developer_2(uint32_t userData);
  void hcom_exec_rqst_testing_developer_3(uint32_t userData);
  void hcom_exec_rqst_testing_developer_4(uint32_t userData);
  void hcom_exec_rqst_testing_gpio_output(uint32_t pinNumber);
  void hcom_exec_rqst_testing_gpio_input(void);

#endif // __ASSEMBLY__

#undef EXTERN
#if defined(__cplusplus)
}
#endif

#endif // __CONFIGS_MEADOW_SRC_MEADOW_HOSTCOM__H
